Model: "sequential_9"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_44 (Conv2D)           (None, 222, 222, 32)      896       
_________________________________________________________________
conv2d_45 (Conv2D)           (None, 220, 220, 64)      18496     
_________________________________________________________________
max_pooling2d_31 (MaxPooling (None, 110, 110, 64)      0         
_________________________________________________________________
dropout_42 (Dropout)         (None, 110, 110, 64)      0         
_________________________________________________________________
conv2d_46 (Conv2D)           (None, 108, 108, 64)      36928     
_________________________________________________________________
max_pooling2d_32 (MaxPooling (None, 54, 54, 64)        0         
_________________________________________________________________
dropout_43 (Dropout)         (None, 54, 54, 64)        0         
_________________________________________________________________
conv2d_47 (Conv2D)           (None, 52, 52, 128)       73856     
_________________________________________________________________
max_pooling2d_33 (MaxPooling (None, 26, 26, 128)       0         
_________________________________________________________________
dropout_44 (Dropout)         (None, 26, 26, 128)       0         
_________________________________________________________________
flatten_8 (Flatten)          (None, 86528)             0         
_________________________________________________________________
dense_23 (Dense)             (None, 64)                5537856   
_________________________________________________________________
dense_24 (Dense)             (None, 128)               8320      
_________________________________________________________________
dropout_45 (Dropout)         (None, 128)               0         
_________________________________________________________________
dense_25 (Dense)             (None, 1)                 129       
=================================================================
Total params: 5,676,481
Trainable params: 5,676,481
Non-trainable params: 0
_________________________________________________________________