Model: "sequential_7"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_33 (Conv2D)           (None, 222, 222, 32)      896       
_________________________________________________________________
conv2d_34 (Conv2D)           (None, 220, 220, 64)      18496     
_________________________________________________________________
max_pooling2d_22 (MaxPooling (None, 110, 110, 64)      0         
_________________________________________________________________
dropout_31 (Dropout)         (None, 110, 110, 64)      0         
_________________________________________________________________
conv2d_35 (Conv2D)           (None, 108, 108, 64)      36928     
_________________________________________________________________
max_pooling2d_23 (MaxPooling (None, 54, 54, 64)        0         
_________________________________________________________________
dropout_32 (Dropout)         (None, 54, 54, 64)        0         
_________________________________________________________________
conv2d_36 (Conv2D)           (None, 52, 52, 128)       73856     
_________________________________________________________________
max_pooling2d_24 (MaxPooling (None, 26, 26, 128)       0         
_________________________________________________________________
dropout_33 (Dropout)         (None, 26, 26, 128)       0         
_________________________________________________________________
conv2d_37 (Conv2D)           (None, 24, 24, 256)       295168    
_________________________________________________________________
max_pooling2d_25 (MaxPooling (None, 12, 12, 256)       0         
_________________________________________________________________
dropout_34 (Dropout)         (None, 12, 12, 256)       0         
_________________________________________________________________
flatten_6 (Flatten)          (None, 36864)             0         
_________________________________________________________________
dense_15 (Dense)             (None, 64)                2359360   
_________________________________________________________________
dense_16 (Dense)             (None, 128)               8320      
_________________________________________________________________
dense_17 (Dense)             (None, 256)               33024     
_________________________________________________________________
dropout_35 (Dropout)         (None, 256)               0         
_________________________________________________________________
dense_18 (Dense)             (None, 1)                 257       
=================================================================
Total params: 2,826,305
Trainable params: 2,826,305
Non-trainable params: 0
_________________________________________________________________