Model: "sequential_8"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_38 (Conv2D)           (None, 222, 222, 32)      896       
_________________________________________________________________
conv2d_39 (Conv2D)           (None, 220, 220, 64)      18496     
_________________________________________________________________
max_pooling2d_26 (MaxPooling (None, 110, 110, 64)      0         
_________________________________________________________________
dropout_36 (Dropout)         (None, 110, 110, 64)      0         
_________________________________________________________________
conv2d_40 (Conv2D)           (None, 108, 108, 64)      36928     
_________________________________________________________________
max_pooling2d_27 (MaxPooling (None, 54, 54, 64)        0         
_________________________________________________________________
dropout_37 (Dropout)         (None, 54, 54, 64)        0         
_________________________________________________________________
conv2d_41 (Conv2D)           (None, 52, 52, 128)       73856     
_________________________________________________________________
max_pooling2d_28 (MaxPooling (None, 26, 26, 128)       0         
_________________________________________________________________
dropout_38 (Dropout)         (None, 26, 26, 128)       0         
_________________________________________________________________
conv2d_42 (Conv2D)           (None, 24, 24, 128)       147584    
_________________________________________________________________
max_pooling2d_29 (MaxPooling (None, 12, 12, 128)       0         
_________________________________________________________________
dropout_39 (Dropout)         (None, 12, 12, 128)       0         
_________________________________________________________________
conv2d_43 (Conv2D)           (None, 10, 10, 256)       295168    
_________________________________________________________________
max_pooling2d_30 (MaxPooling (None, 5, 5, 256)         0         
_________________________________________________________________
dropout_40 (Dropout)         (None, 5, 5, 256)         0         
_________________________________________________________________
flatten_7 (Flatten)          (None, 6400)              0         
_________________________________________________________________
dense_19 (Dense)             (None, 64)                409664    
_________________________________________________________________
dense_20 (Dense)             (None, 128)               8320      
_________________________________________________________________
dense_21 (Dense)             (None, 256)               33024     
_________________________________________________________________
dropout_41 (Dropout)         (None, 256)               0         
_________________________________________________________________
dense_22 (Dense)             (None, 1)                 257       
=================================================================
Total params: 1,024,193
Trainable params: 1,024,193
Non-trainable params: 0
_________________________________________________________________